run/cavityBingham/constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel BinghamPapanastasiou; 
BinghamPapanastasiouCoeffs 
{ 
	eps      [ 0 0 -1 0 0 0 0 ] 0.0025; 
	tau0     [ 0 2 -2 0 0 0 0 ] 1.0; 
	k        [ 0 2 -1 0 0 0 0 ] 0.1; 
}

// ************************************************************************* //
